# ####################################################################

#  Created by Genus(TM) Synthesis Solution 22.17-s071_1 on Tue Jul 14 11:19:34 -03 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design pipelined_processor_FPU

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_transition 1.0 [get_clocks clk]
set_load -pin_load 0.04 [get_ports RegWriteW]
set_load -pin_load 0.04 [get_ports RegWriteFW]
set_load -pin_load 0.04 [get_ports {RdW[4]}]
set_load -pin_load 0.04 [get_ports {RdW[3]}]
set_load -pin_load 0.04 [get_ports {RdW[2]}]
set_load -pin_load 0.04 [get_ports {RdW[1]}]
set_load -pin_load 0.04 [get_ports {RdW[0]}]
set_load -pin_load 0.04 [get_ports {ResultW[31]}]
set_load -pin_load 0.04 [get_ports {ResultW[30]}]
set_load -pin_load 0.04 [get_ports {ResultW[29]}]
set_load -pin_load 0.04 [get_ports {ResultW[28]}]
set_load -pin_load 0.04 [get_ports {ResultW[27]}]
set_load -pin_load 0.04 [get_ports {ResultW[26]}]
set_load -pin_load 0.04 [get_ports {ResultW[25]}]
set_load -pin_load 0.04 [get_ports {ResultW[24]}]
set_load -pin_load 0.04 [get_ports {ResultW[23]}]
set_load -pin_load 0.04 [get_ports {ResultW[22]}]
set_load -pin_load 0.04 [get_ports {ResultW[21]}]
set_load -pin_load 0.04 [get_ports {ResultW[20]}]
set_load -pin_load 0.04 [get_ports {ResultW[19]}]
set_load -pin_load 0.04 [get_ports {ResultW[18]}]
set_load -pin_load 0.04 [get_ports {ResultW[17]}]
set_load -pin_load 0.04 [get_ports {ResultW[16]}]
set_load -pin_load 0.04 [get_ports {ResultW[15]}]
set_load -pin_load 0.04 [get_ports {ResultW[14]}]
set_load -pin_load 0.04 [get_ports {ResultW[13]}]
set_load -pin_load 0.04 [get_ports {ResultW[12]}]
set_load -pin_load 0.04 [get_ports {ResultW[11]}]
set_load -pin_load 0.04 [get_ports {ResultW[10]}]
set_load -pin_load 0.04 [get_ports {ResultW[9]}]
set_load -pin_load 0.04 [get_ports {ResultW[8]}]
set_load -pin_load 0.04 [get_ports {ResultW[7]}]
set_load -pin_load 0.04 [get_ports {ResultW[6]}]
set_load -pin_load 0.04 [get_ports {ResultW[5]}]
set_load -pin_load 0.04 [get_ports {ResultW[4]}]
set_load -pin_load 0.04 [get_ports {ResultW[3]}]
set_load -pin_load 0.04 [get_ports {ResultW[2]}]
set_load -pin_load 0.04 [get_ports {ResultW[1]}]
set_load -pin_load 0.04 [get_ports {ResultW[0]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[31]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[30]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[29]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[28]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[27]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[26]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[25]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[24]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[23]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[22]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[21]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[20]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[19]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[18]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[17]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[16]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[15]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[14]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[13]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[12]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[11]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[10]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[9]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[8]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[7]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[6]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[5]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[4]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[3]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[2]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[1]}]
set_load -pin_load 0.04 [get_ports {WriteDataM[0]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[31]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[30]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[29]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[28]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[27]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[26]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[25]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[24]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[23]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[22]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[21]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[20]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[19]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[18]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[17]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[16]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[15]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[14]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[13]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[12]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[11]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[10]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[9]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[8]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[7]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[6]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[5]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[4]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[3]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[2]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[1]}]
set_load -pin_load 0.04 [get_ports {ALUResultM[0]}]
set_load -pin_load 0.04 [get_ports {InstrDC[31]}]
set_load -pin_load 0.04 [get_ports {InstrDC[30]}]
set_load -pin_load 0.04 [get_ports {InstrDC[29]}]
set_load -pin_load 0.04 [get_ports {InstrDC[28]}]
set_load -pin_load 0.04 [get_ports {InstrDC[27]}]
set_load -pin_load 0.04 [get_ports {InstrDC[26]}]
set_load -pin_load 0.04 [get_ports {InstrDC[25]}]
set_load -pin_load 0.04 [get_ports {InstrDC[24]}]
set_load -pin_load 0.04 [get_ports {InstrDC[23]}]
set_load -pin_load 0.04 [get_ports {InstrDC[22]}]
set_load -pin_load 0.04 [get_ports {InstrDC[21]}]
set_load -pin_load 0.04 [get_ports {InstrDC[20]}]
set_load -pin_load 0.04 [get_ports {InstrDC[19]}]
set_load -pin_load 0.04 [get_ports {InstrDC[18]}]
set_load -pin_load 0.04 [get_ports {InstrDC[17]}]
set_load -pin_load 0.04 [get_ports {InstrDC[16]}]
set_load -pin_load 0.04 [get_ports {InstrDC[15]}]
set_load -pin_load 0.04 [get_ports {InstrDC[14]}]
set_load -pin_load 0.04 [get_ports {InstrDC[13]}]
set_load -pin_load 0.04 [get_ports {InstrDC[12]}]
set_load -pin_load 0.04 [get_ports {InstrDC[11]}]
set_load -pin_load 0.04 [get_ports {InstrDC[10]}]
set_load -pin_load 0.04 [get_ports {InstrDC[9]}]
set_load -pin_load 0.04 [get_ports {InstrDC[8]}]
set_load -pin_load 0.04 [get_ports {InstrDC[7]}]
set_load -pin_load 0.04 [get_ports {InstrDC[6]}]
set_load -pin_load 0.04 [get_ports {InstrDC[5]}]
set_load -pin_load 0.04 [get_ports {InstrDC[4]}]
set_load -pin_load 0.04 [get_ports {InstrDC[3]}]
set_load -pin_load 0.04 [get_ports {InstrDC[2]}]
set_load -pin_load 0.04 [get_ports {InstrDC[1]}]
set_load -pin_load 0.04 [get_ports {InstrDC[0]}]
set_load -pin_load 0.04 [get_ports MemWriteM]
set_clock_gating_check -setup 0.0 
set_input_transition -min 0.1 [get_ports we]
set_input_transition -max 1.0 [get_ports we]
set_input_transition -min 0.1 [get_ports {WA[31]}]
set_input_transition -max 1.0 [get_ports {WA[31]}]
set_input_transition -min 0.1 [get_ports {WA[30]}]
set_input_transition -max 1.0 [get_ports {WA[30]}]
set_input_transition -min 0.1 [get_ports {WA[29]}]
set_input_transition -max 1.0 [get_ports {WA[29]}]
set_input_transition -min 0.1 [get_ports {WA[28]}]
set_input_transition -max 1.0 [get_ports {WA[28]}]
set_input_transition -min 0.1 [get_ports {WA[27]}]
set_input_transition -max 1.0 [get_ports {WA[27]}]
set_input_transition -min 0.1 [get_ports {WA[26]}]
set_input_transition -max 1.0 [get_ports {WA[26]}]
set_input_transition -min 0.1 [get_ports {WA[25]}]
set_input_transition -max 1.0 [get_ports {WA[25]}]
set_input_transition -min 0.1 [get_ports {WA[24]}]
set_input_transition -max 1.0 [get_ports {WA[24]}]
set_input_transition -min 0.1 [get_ports {WA[23]}]
set_input_transition -max 1.0 [get_ports {WA[23]}]
set_input_transition -min 0.1 [get_ports {WA[22]}]
set_input_transition -max 1.0 [get_ports {WA[22]}]
set_input_transition -min 0.1 [get_ports {WA[21]}]
set_input_transition -max 1.0 [get_ports {WA[21]}]
set_input_transition -min 0.1 [get_ports {WA[20]}]
set_input_transition -max 1.0 [get_ports {WA[20]}]
set_input_transition -min 0.1 [get_ports {WA[19]}]
set_input_transition -max 1.0 [get_ports {WA[19]}]
set_input_transition -min 0.1 [get_ports {WA[18]}]
set_input_transition -max 1.0 [get_ports {WA[18]}]
set_input_transition -min 0.1 [get_ports {WA[17]}]
set_input_transition -max 1.0 [get_ports {WA[17]}]
set_input_transition -min 0.1 [get_ports {WA[16]}]
set_input_transition -max 1.0 [get_ports {WA[16]}]
set_input_transition -min 0.1 [get_ports {WA[15]}]
set_input_transition -max 1.0 [get_ports {WA[15]}]
set_input_transition -min 0.1 [get_ports {WA[14]}]
set_input_transition -max 1.0 [get_ports {WA[14]}]
set_input_transition -min 0.1 [get_ports {WA[13]}]
set_input_transition -max 1.0 [get_ports {WA[13]}]
set_input_transition -min 0.1 [get_ports {WA[12]}]
set_input_transition -max 1.0 [get_ports {WA[12]}]
set_input_transition -min 0.1 [get_ports {WA[11]}]
set_input_transition -max 1.0 [get_ports {WA[11]}]
set_input_transition -min 0.1 [get_ports {WA[10]}]
set_input_transition -max 1.0 [get_ports {WA[10]}]
set_input_transition -min 0.1 [get_ports {WA[9]}]
set_input_transition -max 1.0 [get_ports {WA[9]}]
set_input_transition -min 0.1 [get_ports {WA[8]}]
set_input_transition -max 1.0 [get_ports {WA[8]}]
set_input_transition -min 0.1 [get_ports {WA[7]}]
set_input_transition -max 1.0 [get_ports {WA[7]}]
set_input_transition -min 0.1 [get_ports {WA[6]}]
set_input_transition -max 1.0 [get_ports {WA[6]}]
set_input_transition -min 0.1 [get_ports {WA[5]}]
set_input_transition -max 1.0 [get_ports {WA[5]}]
set_input_transition -min 0.1 [get_ports {WA[4]}]
set_input_transition -max 1.0 [get_ports {WA[4]}]
set_input_transition -min 0.1 [get_ports {WA[3]}]
set_input_transition -max 1.0 [get_ports {WA[3]}]
set_input_transition -min 0.1 [get_ports {WA[2]}]
set_input_transition -max 1.0 [get_ports {WA[2]}]
set_input_transition -min 0.1 [get_ports {WA[1]}]
set_input_transition -max 1.0 [get_ports {WA[1]}]
set_input_transition -min 0.1 [get_ports {WA[0]}]
set_input_transition -max 1.0 [get_ports {WA[0]}]
set_input_transition -min 0.1 [get_ports {din[31]}]
set_input_transition -max 1.0 [get_ports {din[31]}]
set_input_transition -min 0.1 [get_ports {din[30]}]
set_input_transition -max 1.0 [get_ports {din[30]}]
set_input_transition -min 0.1 [get_ports {din[29]}]
set_input_transition -max 1.0 [get_ports {din[29]}]
set_input_transition -min 0.1 [get_ports {din[28]}]
set_input_transition -max 1.0 [get_ports {din[28]}]
set_input_transition -min 0.1 [get_ports {din[27]}]
set_input_transition -max 1.0 [get_ports {din[27]}]
set_input_transition -min 0.1 [get_ports {din[26]}]
set_input_transition -max 1.0 [get_ports {din[26]}]
set_input_transition -min 0.1 [get_ports {din[25]}]
set_input_transition -max 1.0 [get_ports {din[25]}]
set_input_transition -min 0.1 [get_ports {din[24]}]
set_input_transition -max 1.0 [get_ports {din[24]}]
set_input_transition -min 0.1 [get_ports {din[23]}]
set_input_transition -max 1.0 [get_ports {din[23]}]
set_input_transition -min 0.1 [get_ports {din[22]}]
set_input_transition -max 1.0 [get_ports {din[22]}]
set_input_transition -min 0.1 [get_ports {din[21]}]
set_input_transition -max 1.0 [get_ports {din[21]}]
set_input_transition -min 0.1 [get_ports {din[20]}]
set_input_transition -max 1.0 [get_ports {din[20]}]
set_input_transition -min 0.1 [get_ports {din[19]}]
set_input_transition -max 1.0 [get_ports {din[19]}]
set_input_transition -min 0.1 [get_ports {din[18]}]
set_input_transition -max 1.0 [get_ports {din[18]}]
set_input_transition -min 0.1 [get_ports {din[17]}]
set_input_transition -max 1.0 [get_ports {din[17]}]
set_input_transition -min 0.1 [get_ports {din[16]}]
set_input_transition -max 1.0 [get_ports {din[16]}]
set_input_transition -min 0.1 [get_ports {din[15]}]
set_input_transition -max 1.0 [get_ports {din[15]}]
set_input_transition -min 0.1 [get_ports {din[14]}]
set_input_transition -max 1.0 [get_ports {din[14]}]
set_input_transition -min 0.1 [get_ports {din[13]}]
set_input_transition -max 1.0 [get_ports {din[13]}]
set_input_transition -min 0.1 [get_ports {din[12]}]
set_input_transition -max 1.0 [get_ports {din[12]}]
set_input_transition -min 0.1 [get_ports {din[11]}]
set_input_transition -max 1.0 [get_ports {din[11]}]
set_input_transition -min 0.1 [get_ports {din[10]}]
set_input_transition -max 1.0 [get_ports {din[10]}]
set_input_transition -min 0.1 [get_ports {din[9]}]
set_input_transition -max 1.0 [get_ports {din[9]}]
set_input_transition -min 0.1 [get_ports {din[8]}]
set_input_transition -max 1.0 [get_ports {din[8]}]
set_input_transition -min 0.1 [get_ports {din[7]}]
set_input_transition -max 1.0 [get_ports {din[7]}]
set_input_transition -min 0.1 [get_ports {din[6]}]
set_input_transition -max 1.0 [get_ports {din[6]}]
set_input_transition -min 0.1 [get_ports {din[5]}]
set_input_transition -max 1.0 [get_ports {din[5]}]
set_input_transition -min 0.1 [get_ports {din[4]}]
set_input_transition -max 1.0 [get_ports {din[4]}]
set_input_transition -min 0.1 [get_ports {din[3]}]
set_input_transition -max 1.0 [get_ports {din[3]}]
set_input_transition -min 0.1 [get_ports {din[2]}]
set_input_transition -max 1.0 [get_ports {din[2]}]
set_input_transition -min 0.1 [get_ports {din[1]}]
set_input_transition -max 1.0 [get_ports {din[1]}]
set_input_transition -min 0.1 [get_ports {din[0]}]
set_input_transition -max 1.0 [get_ports {din[0]}]
set_input_transition -min 0.1 [get_ports reset]
set_input_transition -max 1.0 [get_ports reset]
set_wire_load_mode "enclosed"
set_clock_latency -source 0.5 [get_clocks clk]
set_clock_uncertainty -setup 1.0 [get_clocks clk]
set_clock_uncertainty -hold 1.0 [get_clocks clk]
